ajayparida/sdk-nrf/drivers/wifi/nrf71/src/wifi_util.c
	shell_fprintf(sh,
		      SHELL_INFO,
		      "FTM measurement started for %u peer(s)\n",
		      ftm_cmd.info.n_peers);
	ret = 0;
unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

static int nrf_wifi_util_neighbor_req(const struct shell *sh,
				      size_t argc,
				      char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_cmd_neighbor_req_config neighbor_cmd;
	char conf_buf[256];
	unsigned long val = 0;
	size_t off = 0;
	unsigned int i = 0;
	int ret = 0;

	memset(&neighbor_cmd, 0, sizeof(neighbor_cmd));

	/* Re-assemble the "<key>=<value>" tokens into a single buffer so they
	 * can be parsed regardless of order. Pass the whole parameter list as
	 * one quoted argument to avoid the shell's argument count limit
	 * (CONFIG_SHELL_ARGC_MAX).
	 */
	for (i = 1; i < argc; i++) {
		int n = snprintf(conf_buf + off,
				 sizeof(conf_buf) - off,
				 "%s%s",
				 (off ? " " : ""),
				 argv[i]);

		if ((n < 0) || ((size_t)n >= sizeof(conf_buf) - off)) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "Neighbor request parameters too long\n");
			return -ENOEXEC;
		}
		off += n;
	}

	val = 0;
	ftm_parse_uint(conf_buf, "token=", &val);
	neighbor_cmd.info.dialog_token = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "sub_elems=", &val);
	neighbor_cmd.info.sub_elems = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "lci_mode=", &val);
	neighbor_cmd.info.lci.req_mode = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "lci_token=", &val);
	neighbor_cmd.info.lci.req_token = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "lci_sub=", &val);
	neighbor_cmd.info.lci.req_sub = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_mode=", &val);
	neighbor_cmd.info.civic.req_mode = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_token=", &val);
	neighbor_cmd.info.civic.req_token = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_sub=", &val);
	neighbor_cmd.info.civic.req_sub = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_loc_type=", &val);
	neighbor_cmd.info.civic_loc_type = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_interval_units=", &val);
	neighbor_cmd.info.civic_interval_units = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "civic_interval=", &val);
	neighbor_cmd.info.civic_interval = (unsigned short)val;

	neighbor_cmd.umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_CONFIG_NEIGHBOR_REQ;
	neighbor_cmd.umac_hdr.ids.wdev_id = 0;
	neighbor_cmd.umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}
	fmac_dev_ctx = ctx->rpu_ctx;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      &neighbor_cmd,
			      sizeof(neighbor_cmd));
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Neighbor request command failed\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	shell_fprintf(sh,
		      SHELL_INFO,
		      "Neighbor request sent (token=%u)\n",
		      neighbor_cmd.info.dialog_token);
	ret = 0;
unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

#define GAS_QUERY_IDS_MAX_LEN 64

static int nrf_wifi_util_gas_req(const struct shell *sh,
				 size_t argc,
				 char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	unsigned char cmd_buf[sizeof(struct nrf_wifi_cmd_gas_anqp_config) +
			      GAS_QUERY_IDS_MAX_LEN];
	struct nrf_wifi_cmd_gas_anqp_config *gas_cmd =
		(struct nrf_wifi_cmd_gas_anqp_config *)cmd_buf;
	char conf_buf[256];
	unsigned int mac[NRF_WIFI_ETH_ADDR_LEN];
	unsigned long val = 0;
	size_t off = 0;
	unsigned int i = 0;
	int query_len = 0;
	int hex_ret = 0;
	int ret = 0;

	memset(cmd_buf, 0, sizeof(cmd_buf));

	/* Re-assemble the "<key>=<value>" tokens into a single buffer so they
	 * can be parsed regardless of order. Pass the whole parameter list as
	 * one quoted argument to avoid the shell's argument count limit
	 * (CONFIG_SHELL_ARGC_MAX).
	 */
	for (i = 1; i < argc; i++) {
		int n = snprintf(conf_buf + off,
				 sizeof(conf_buf) - off,
				 "%s%s",
				 (off ? " " : ""),
				 argv[i]);

		if ((n < 0) || ((size_t)n >= sizeof(conf_buf) - off)) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "GAS request parameters too long\n");
			return -ENOEXEC;
		}
		off += n;
	}

	if (strstr(conf_buf, "mac_addr=")) {
		if (sscanf(strstr(conf_buf, "mac_addr=") + strlen("mac_addr="),
			   "%x:%x:%x:%x:%x:%x",
			   &mac[0], &mac[1], &mac[2],
			   &mac[3], &mac[4], &mac[5]) != NRF_WIFI_ETH_ADDR_LEN) {
			shell_fprintf(sh,
				      SHELL_ERROR,
				      "Invalid mac_addr (expected xx:xx:xx:xx:xx:xx)\n");
			return -ENOEXEC;
		}
		for (i = 0; i < NRF_WIFI_ETH_ADDR_LEN; i++) {
			gas_cmd->info.bssid[i] = (unsigned char)mac[i];
		}
	}

	val = 0;
	ftm_parse_uint(conf_buf, "token=", &val);
	gas_cmd->info.dialog_token = (unsigned char)val;

	val = 0;
	ftm_parse_uint(conf_buf, "channel=", &val);
	gas_cmd->info.channel_num = (unsigned int)val;

	val = 0;
	ftm_parse_uint(conf_buf, "band=", &val);
	gas_cmd->info.band = (signed int)val;

	hex_ret = util_parse_hex(conf_buf,
				 "protocol=",
				 gas_cmd->info.protocol_ie,
				 sizeof(gas_cmd->info.protocol_ie));
	if (hex_ret < 0) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid protocol value (expected hex string)\n");
		return -ENOEXEC;
	}

	val = 0;
	ftm_parse_uint(conf_buf, "length=", &val);
	gas_cmd->info.length = (unsigned char)val;

	query_len = util_parse_hex(conf_buf,
				   "query_ids=",
				   gas_cmd->info.query_ids,
				   GAS_QUERY_IDS_MAX_LEN);
	if (query_len < 0) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid query_ids value (expected hex string)\n");
		return -ENOEXEC;
	}

	/* If length was not supplied, derive it from the parsed query_ids. */
	if (gas_cmd->info.length == 0) {
		gas_cmd->info.length = (unsigned char)query_len;
	}

	if (gas_cmd->info.length > GAS_QUERY_IDS_MAX_LEN) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "query length %u exceeds maximum %d\n",
			      gas_cmd->info.length,
			      GAS_QUERY_IDS_MAX_LEN);
		return -ENOEXEC;
	}

	gas_cmd->umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_GAS_ANQP_QUERY;
	gas_cmd->umac_hdr.ids.wdev_id = 0;
	gas_cmd->umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}
	fmac_dev_ctx = ctx->rpu_ctx;

	status = umac_cmd_cfg(fmac_dev_ctx,
			      gas_cmd,
			      sizeof(*gas_cmd) + gas_cmd->info.length);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "GAS ANQP query command failed\n");
		ret = -ENOEXEC;
		goto unlock;
	}

